package b_operation;

public class Operation_01 {
	public static void main(String[] args) {
		/*
		1. 연산자
		  - 단항연산자
		    : ++, --, +, -, ~, !, (타입)
		    
		  - 이항연산자
		    : 산술연산자 (+, -, *, /, %)
		    : 비교연산자 (<, >, <=, >=, ==, !=, instanceof)
		    : 논리연산자 (&, |, ^, &&, ||)
		    
		  - 삼항연산자
		    :  (1) ? (2) : (3)
		    
		  - 대입연산자
		    : =, op=  
		    
		2. 연산우선순위
		  - 산술 > 비교 > 논리  > 대입
		  - 단항 > 이항 > 삼항
		  - 단항연산자와 대입연산자를 제외한 모등 연산자의 진행방향은
		     왼쪽에서 오른쪽 이다.
		
		
		
		
		*/
		
		
	}
}
